{
  "Version": "137",
  "Year": "2025",
  "Semester": "Spring",
  "project_name": "Washington, D.C. Housing Price Analysis: Trends, Forecasting, and Affordability",
  "Objective": " \n        The objective of this project is to analyze housing price trends in the Washington, D.C. metro area using \n        Zillow's Home Value Index (ZHVI) data. The goal is to identify key factors influencing housing prices, \n        forecast future trends, and evaluate the affordability of housing in the region. \n        \n        This project aims to provide actionable insights for real estate professionals, urban planners, and policymakers.\n    ",
  "Dataset": "\n        The datasets for this project are sourced from Zillow Research's publicly available data platform, \n        which provides reliable and regularly updated metrics on housing markets across the U.S.\n\n        1. Zillow Home Value Index (ZHVI): All Homes, Smoothed, Seasonally Adjusted (Monthly)\n            - A measure of typical home values across all housing types.\n\n        2. Zillow Home Value Forecast (ZHVF): All Homes, Smoothed, Seasonally Adjusted, Mid-Tier (Monthly)\n            - Predictive insights into future home values.\n\n        3. For-Sale Listings: Median Sale Price\n            - The median sale price of homes sold within the Washington, D.C. Metro area.\n\n        4. For-Sale Inventory: All Homes\n            - The number of unique for-sale listings active during each month.\n\n        5. Affordability Metrics: New Homeowner Income Needed (20% down)\n            - Estimates the annual income required to afford the total monthly payment on a typical home purchase.\n\n        Data is in time-series format and will be preprocessed before modeling.\n    ",
  "Rationale": "\n        Housing affordability and price trends are critical economic indicators that impact \n        policymakers, investors, and homebuyers. Understanding these trends can guide better \n        decision-making in urban development and housing policy.\n    ",
  "Approach": "\n        This capstone will follow a structured Data Science approach:\n\n        1. Data Collection and Cleaning\n            - Download Zillow datasets and preprocess them (handling missing data, transformations).\n\n        2. Exploratory Data Analysis (EDA)  \n            - Visualize historical price trends, neighborhood disparities, and affordability.\n\n        3. Feature Engineering \n            - Create new variables such as price per square foot and housing market indicators.\n\n        4. Model Development\n            - Build regression and time-series forecasting models (ARIMA, Prophet, or ML-based).\n\n        5. Visualization and Reporting\n            - Create dashboards using Tableau/Power BI, Matplotlib, and Seaborn.\n\n        6. Presentation and Final Report  \n            - Summarize findings in a well-documented report with key insights and policy recommendations.\n    ",
  "Timeline": "\n        - Weeks 1-2: Data Collection and Cleaning  \n        - Weeks 3-4: Exploratory Data Analysis and Feature Engineering  \n        - Weeks 5-6: Model Development and Evaluation  \n        - Week 7: Visualization and Dashboard Creation  \n        - Week 8: Final Report, Poster, and Presentation Preparation  \n    ",
  "Expected Number Students": "\n        This project is designed for just me.\n    ",
  "Possible Issues": "\n        - Data Completeness: Zillow data may have missing values or inconsistencies.  \n          Solution: Apply imputation techniques or drop non-essential missing data.  \n\n        - Model Overfitting: Complex models may not generalize well to unseen data.  \n          Solution: Use cross-validation and regularization techniques.  \n\n        - Geospatial Complexity: Mapping trends by neighborhood may be affected by boundary inconsistencies.  \n          Solution: Validate geographic data using external sources.  \n\n        - Interpretability: Ensuring that insights are actionable for non-technical stakeholders.  \n          Solution: Emphasize clear visualizations and concise reporting.  \n    ",
  "Proposed by": "Raymond Ding",
  "Proposed by email": "rding23@gwu.edu",
  "instructor": "Sushovan Majhi",
  "instructor_email": "s.majhi@gwu.edu",
  "github_repo": "https://github.com/GW-datasci/25-spring-rding"
}